package fo0;

import am.C0927o;
import com.zing.zalo.zmedia.player.IMediaPlayer;
import java.util.BitSet;

/* renamed from: fo0.d */
/* loaded from: classes7.dex */
abstract class AbstractC19093d {
    /* JADX INFO: Access modifiers changed from: package-private */
    /* renamed from: a */
    public static C19094e m100294a(boolean z11) {
        C19090a c19090a = new C19090a(0);
        C19091b c19091b = new C19091b(null);
        C19090a c19090a2 = new C19090a(65535);
        BitSet bitSet = new BitSet();
        BitSet bitSet2 = new BitSet();
        m100295b(c19090a, c19091b, c19090a2, bitSet, bitSet2);
        return new C19094e(c19090a, c19091b, c19090a2, bitSet, bitSet2);
    }

    /* renamed from: b */
    private static void m100295b(C19090a c19090a, C19091b c19091b, C19090a c19090a2, BitSet bitSet, BitSet bitSet2) {
        char c11;
        int i11 = 0;
        String[] strArr = {"^", " ̂", "K", "_", " ̲", "K", "`", " ̀", "K", " ", " ", "K", "¨", " ̈", "K", "ª", "a", "K", "¯", " ̄", "K", "²", "2", "K", "³", "3", "K", "´", " ́", "K", "µ", "μ", "K", "¸", " ̧", "K", "¹", "1", "K", "º", C0927o.f3427r, "K", "¼", "1⁄4", "K", "½", "1⁄2", "K", "¾", "3⁄4", "K", "À", "À", "", "Á", "Á", "", "Â", "Â", "", "Ã", "Ã", "", "Ä", "Ä", "", "Å", "Å", "", "Ç", "Ç", "", "È", "È", "", "É", "É", "", "Ê", "Ê", "", "Ë", "Ë", "", "Ì", "Ì", "", "Í", "Í", "", "Î", "Î", "", "Ï", "Ï", "", "Ñ", "Ñ", "", "Ò", "Ò", "", "Ó", "Ó", "", "Ô", "Ô", "", "Õ", "Õ", "", "Ö", "Ö", "", "Ù", "Ù", "", "Ú", "Ú", "", "Û", "Û", "", "Ü", "Ü", "", "Ý", "Ý", "", "à", "à", "", "á", "á", "", "â", "â", "", "ã", "ã", "", "ä", "ä", "", "å", "å", "", "ç", "ç", "", "è", "è", "", "é", "é", "", "ê", "ê", "", "ë", "ë", "", "ì", "ì", "", "í", "í", "", "î", "î", "", "ï", "ï", "", "ñ", "ñ", "", "ò", "ò", "", "ó", "ó", "", "ô", "ô", "", "õ", "õ", "", "ö", "ö", "", "ù", "ù", "", "ú", "ú", "", "û", "û", "", "ü", "ü", "", "ý", "ý", "", "Ă", "Ă", "", "ă", "ă", "", "Ĩ", "Ĩ", "", "ĩ", "ĩ", "", "Ũ", "Ũ", "", "ũ", "ũ", "", "Ơ", "Ơ", "", "ơ", "ơ", "", "Ư", "Ư", "", "ư", "ư", "", "Ạ", "Ạ", "", "ạ", "ạ", "", "Ả", "Ả", "", "ả", "ả", "", "Ấ", "Ấ", "", "ấ", "ấ", "", "Ầ", "Ầ", "", "ầ", "ầ", "", "Ẩ", "Ẩ", "", "ẩ", "ẩ", "", "Ẫ", "Ẫ", "", "ẫ", "ẫ", "", "Ậ", "Ậ", "", "ậ", "ậ", "", "Ắ", "Ắ", "", "ắ", "ắ", "", "Ằ", "Ằ", "", "ằ", "ằ", "", "Ẳ", "Ẳ", "", "ẳ", "ẳ", "", "Ẵ", "Ẵ", "", "ẵ", "ẵ", "", "Ặ", "Ặ", "", "ặ", "ặ", "", "Ẹ", "Ẹ", "", "ẹ", "ẹ", "", "Ẻ", "Ẻ", "", "ẻ", "ẻ", "", "Ẽ", "Ẽ", "", "ẽ", "ẽ", "", "Ế", "Ế", "", "ế", "ế", "", "Ề", "Ề", "", "ề", "ề", "", "Ể", "Ể", "", "ể", "ể", "", "Ễ", "Ễ", "", "ễ", "ễ", "", "Ệ", "Ệ", "", "ệ", "ệ", "", "Ỉ", "Ỉ", "", "ỉ", "ỉ", "", "Ị", "Ị", "", "ị", "ị", "", "Ọ", "Ọ", "", "ọ", "ọ", "", "Ỏ", "Ỏ", "", "ỏ", "ỏ", "", "Ố", "Ố", "", "ố", "ố", "", "Ồ", "Ồ", "", "ồ", "ồ", "", "Ổ", "Ổ", "", "ổ", "ổ", "", "Ỗ", "Ỗ", "", "ỗ", "ỗ", "", "Ộ", "Ộ", "", "ộ", "ộ", "", "Ớ", "Ớ", "", "ớ", "ớ", "", "Ờ", "Ờ", "", "ờ", "ờ", "", "Ở", "Ở", "", "ở", "ở", "", "Ỡ", "Ỡ", "", "ỡ", "ỡ", "", "Ợ", "Ợ", "", "ợ", "ợ", "", "Ụ", "Ụ", "", "ụ", "ụ", "", "Ủ", "Ủ", "", "ủ", "ủ", "", "Ứ", "Ứ", "", "ứ", "ứ", "", "Ừ", "Ừ", "", "ừ", "ừ", "", "Ử", "Ử", "", "ử", "ử", "", "Ữ", "Ữ", "", "ữ", "ữ", "", "Ự", "Ự", "", "ự", "ự", "", "Ỳ", "Ỳ", "", "ỳ", "ỳ", "", "Ỵ", "Ỵ", "", "ỵ", "ỵ", "", "Ỷ", "Ỷ", "", "ỷ", "ỷ", "", "Ỹ", "Ỹ", "", "ỹ", "ỹ", ""};
        int[] iArr = {768, 230, 769, 230, 770, 230, 771, 230, 772, 230, 773, 230, 774, 230, 775, 230, 776, 230, 777, 230, 778, 230, 779, 230, 780, 230, 781, 230, 782, 230, 783, 230, 784, 230, 785, 230, 786, 230, 787, 230, 788, 230, 789, 232, 790, 220, 791, 220, 792, 220, 793, 220, 794, 232, 795, 216, 796, 220, 797, 220, 798, 220, 799, 220, IMediaPlayer.MEDIA_INFO_BAD_INTERLEAVING, 220, IMediaPlayer.MEDIA_INFO_NOT_SEEKABLE, 202, IMediaPlayer.MEDIA_INFO_METADATA_UPDATE, 202, 803, 220, 804, 220, 805, 220, 806, 220, 807, 202, 808, 202, 809, 220, 810, 220, 811, 220, 812, 220, 813, 220, 814, 220, 815, 220, 816, 220, 817, 220, 818, 220, 819, 220, 820, 1, 821, 1, 822, 1, 823, 1, 824, 1, 825, 220, 826, 220, 827, 220, 828, 220, 829, 230, 830, 230, 831, 230, 832, 230, 833, 230, 834, 230, 835, 230, 836, 230, 837, 240, 864, 234, 865, 234};
        for (int i12 = 0; i12 < 507; i12 += 3) {
            char charAt = strArr[i12].charAt(0);
            String str = strArr[i12 + 1];
            boolean equals = strArr[i12 + 2].equals("K");
            if (equals) {
                bitSet.set(charAt);
            }
            c19091b.m100288b(charAt, str);
            if (!equals) {
                char charAt2 = str.charAt(0);
                if (str.length() > 1) {
                    c11 = str.charAt(1);
                } else {
                    c11 = charAt2;
                    charAt2 = 0;
                }
                c19090a2.m100286b(c11 | (charAt2 << 16), charAt);
            }
        }
        while (i11 < 144) {
            int i13 = i11 + 1;
            int i14 = iArr[i11];
            i11 += 2;
            c19090a.m100286b(i14, iArr[i13]);
        }
    }
}
